{"podcast_details": {"podcast_title": "Daily Motivations", "episode_title": "KEEP CLIMBING", "episode_image": "https://storage.buzzsprout.com/variants/redm7k4qdflt2xhv9vknyjz37tc7/2c6fbec80c7e8317ed20281c1521e888d2fe1922f26eb50d7efad8f0529ebc71.jpeg", "episode_transcript": " Everywhere that you look around you, you can sense that people don't want to see you succeed. But I'm going to plant this in your spirit. The fire and truth on the inside of you will make room for you. Whether the haters like you or not. Doubt is the best salesman that there's ever been. He gets up every day and knocks on your door trying to sell you on the lie that you aren't good enough. But those who can sit in silence and still believe shall one day hear the music of that which they believe for. Each time you face something you fear in truth, you go to a deeper level of growth, awareness and personal power. See the fire grows inside of you when you own and accept everything about you. It's time to stop running and climb. There's three types of people in this world. Those in the game, those on the sidelines, and those in the sand. Watch it. The time has come for you to make a decision right now. Which one of those three do you want to be? Climb. Now you can tell when somebody's about to go to the next level in life. Because you can see it in their eyes when the world turns their back on you. Climb. When the whole world calls you crazy because your dream is so big. Climb. And when you feel like you are at the end of yourself and that you can't take another step, still climb. The most difficult and pivotal times in your life you will have to travel alone. But those who can sit in silence and still believe shall one day hear the music that they believe for. Climb. Warriors and overcomers, they know how to climb. As an heir to the promise, God has given you an inheritance beyond your own capability. The only way you will be able to come in possession of this inheritance is by faith. The real revolution is self-awareness. It's when you awaken to the truth that you yourself determine your own peace, success, and outcome in life. Real success. Real transformation. Real emancipation starts when you finally awaken to your own individual power and the God who gave it to you. Then you boldly wrap yourself in faith and unleash yourself upon the world. Climb. Champion. Climb. Warrior. Climb. Overcomer. Climb. Soldier. Climb. Wrapped in fire. The chosen climb. This is Billy Al's Rooks. And I am blessed and unstoppable via true music. And to God be the glory. Welcome to Daily Motivation, where you get motivated and inspired. There's only two types of people in this world. There's the people that get hit by life and get knocked down and decide to accept what life has given them and they settle. And then there's the people that get hit by life, they go through pain, they face obstacles, they face adversity, but they refuse to give up because they know they have more potential. They know that they are capable of achieving so much more than what life is currently allowing them to achieve right now. That's it. I'm done. No more. No more will I be treated like this. No more will I be overweight. No more will I be in a job that I hate. Making action a must will piss all over the fear you have, I promise you that. What type of person are you? 10 years from now, 20 years from now, are you going to say that you created the life that you are living or are you going to say that you settled for it? You will keep getting the same results you get now. You will keep getting treated the same. You will keep making the same money. You will keep doing the things you don't want to be doing and worst of all, you will get to the end of your life and regret that you didn't try. You're closer than what you think. You're closer than what you think with just a quick shift. You are closer than what you think. Every day is a new day. Every day is a new chance. Every day is a new opportunity to become a little bit better, a little bit smarter, and a little bit stronger than you were yesterday. You close! Hold on! You close! You about to drop out! You've gone too far now! Hold on! Everybody wants to be successful, but don't be mistaken. No, no, no. Success is not an overnight process. Success is the result of taking small steps in the right direction every single day. You're either moving forward or standing still. Make a shift! You don't need a new net! You don't need a new fish! You don't need new bait! You need to change! You close my brother! Hold on! You close! The steps you take don't have to be big. They just have to be in the right direction. What direction are you stepping towards? You close! You close! You must understand that your life is on the line. Every single day you wake up and you get out of your bed. There's competition rising to get to the top of that mountain. What are you going to do to be the winner? How much time would you put in? How much blood, sweat, and tears are you willing to lose? Look yourself in the mirror. Ask yourself, if not now, then when? It doesn't matter if you have a plan. The only thing that matters is the passion that you have in your heart. The only thing that matters is that child, your family, the people that's depending on you the most. It doesn't matter if you have high expectations. It doesn't matter if you just talk about it. You have to write these things down. You have to paint this picture in your head. Ask yourself, what does the top look like? Keep climbing! Yes, there may be rocks falling down on you, trying to hold you down, but you must keep fighting. You must understand that you will fail sometime. You must understand that your hands may slip off those rocks. You must understand that while you're climbing, you cannot see the top, but you must know that it's beautiful. You must know that it's worth it, because that is the very thing that keeps you going. Don't look to the left and see what the other man's doing. Don't look to the right and see what the other man's planning, because your gift is your gift. Show the world that stamina. Show the world how strong you really are. Don't be the person that just talks about it. Don't be the person that just reads about other people's success. Write your own story and place that book at the top of the mountain. We must dream and make it a reality. Keep climbing! If you don't seize the moment, the moment will find someone else who will. I didn't come to just motivate you. I came to transform your life. Pursue the fire, embrace the new, stay in truth in all that you do. Breathe the real. You are enough. No judgment at all. Just radiate love. The world is yours. That desire for more. As the sweat pours, I say it again. The world is yours. There ain't no slacking up, because the words are only good as the actions that are backing them up. Greatness. You are able, but you've got to stop giving average a seat at the table. Lottery pick, one and done. You can either look up at the stars or you can become one by gift of you. A brand new attitude. Complacency is just as dangerous as ingratitude. Now don't get me wrong, I won't judge you, but I will call you out and demand from you that greatness inside of you. To conquer the highest levels of life, one must not only get used to pain, but become immune to it. Champions stare at the things that make them uncomfortable until uncomfortable bows to them. Most people love the idea of being successful. They just don't love it enough to actually do the things that it takes to make it happen. Actions are the credit line that allows spoken words to purchase the dream. It's not all about just talking. You've got to move from talking to doing. If you don't seize the moment, the moment will find someone else who will. The way you speak, the way you act, the way you carry yourself teaches the world how to approach you just because you've done something. Or been a certain way all your life doesn't mean that's the real you. That's just a version that you've accepted and consistently acknowledged. Your dreams are constantly seeking the ground to build themselves upon. And that foundation is your faith to step fully into greatness. You have to awaken to the fact that you are already that what you seek. If you don't seize the moment, the moment will find someone else who will. The masses only see opportunities on Black Friday. Successful people train their mind to see opportunities every day. I'll say it again. The world is yours. Discipline is sexy. Grind is cologne. Sweat is lingerie. Work is seductive. How attractive are you based on that standard? I'm about to give you the million dollar lottery ticket right here. But the question is, would you cash it in if you want to be successful at the highest levels? You've got to stop chasing the trends, seeking followers and getting your word from social media likes. Just be yourself. Set yourself on fire with passion and the world will come to you. See, people who are real, authentic, and willing to be vulnerable on a big stage are rare. This is the ticket. You've got to stand in the center of truth and refuse to move from it. Don't budge. Trust the process and let the world come to you. Everybody's seeking truth. Once you wrap yourself in it, the whole world is yours. I'll say it again. The whole world is yours. Truth is the couture for greatness. You can either serve tomorrow or you can make tomorrow serve you. You can either look up and admire the stars or you can become one. The world is yours. Bold, seeking real. Raw, expressing how you feel. Mentally vulnerable, emotionally naked, unstoppable. Seizing the blessing. The art of greatness. Paint my strobe. Get back up champion and reload. Explode with awareness of who you are. A product of God. A shining star. Live. I say, champions never die. A warrior's heart designed to survive. Explode with awareness of who you are. A product of God. A shining star. Truth is the couture for greatness. No more excuses. The world is yours. Pursue the fire. Embrace the new. Say your truth and all that you do. Breathe the real. You are enough. No judgement at all. Just radiate love. Pursue the fire. Embrace the new. Say your truth and all that you do. Breathe the real. You are enough. No judgement at all. Just radiate love. Rise, champion. The world is yours. This is Billy Olsbrooks and I am blessed and unstoppable. Tick. Tock. Tick. Tock. We've all heard the sound of a clock. Have you ever stopped to think about what it means? There are two fixed points in your life. Birth and death. And what happens in between? That's under your control. It's the only thing under your control. Now we have no idea what the distance between birth and death is going to be. And you've heard the story so many times. Somebody gets really bad news. They find out they've got life threatening cancer. They've only got a few months to live. They quit their job. Sell all their possessions. And go volunteering in a far off country. Giving back to other people. Spending time with the people important to them. And spending time doing the things that really matter the most. So why is it that we wait for such a massive moment for us to take massive action? What if you could change everything today? What if you could change everything in an instant? Right now, watching this video on YouTube, on your phone or your laptop or wherever you are. What if change could happen? I don't care how good you are. I don't care how talented you are. I don't care how much you work on yourself. There are some times when things aren't going to go right. They just are not going to go right. There are times when anything that can happen will happen. Murphy's Law will be knocking at your door. Why? I don't know why. That's called life. And you have to deal with it. Sometimes your life will be in a slump. Just like sports. Some of the best shooters can't hit baskets different times in games. They get in a slump. Do they sit on the sidelines and say, you know, I just did hit a basket today? No. They continue to execute. I suggest to you that if you are facing a challenge, don't stop. Stay busy. Work your plan. Continue to do those things that you know that work for you after you have evaluated yourself in the situation. Continue to move. Stay busy. Stay busy. Stay busy. Repeat after me. Help somebody. And help yourself. Because what you give is what you get. Find somebody that you can help so you can forget about you for a moment. See, sometimes the best thing to do is to be. Sometimes you have to just back up and go within yourself. And I think there's a simple thing that you need that we hear again and again in these motivational speeches that YouTube is littered with. And it's a simple word, but it's misunderstood and it's belief. If you're going to really change, the first thing that you have to move from an opinion to a belief and a belief into a conviction is that you are the one that can change. You are the one that is responsible for who you are, where you are in life right now. The things that you do, the things that you don't do, that you know that you should, the things that you have become, the person that you've become, and as a result the things that you have. And there's all kinds of things going on right now. There's all kinds of thoughts going on right now. There's all kinds of feeling, but amidst all of those things, amidst the sea of confusion that you might feel, let me ask you a very simple question, a very basic question. Do you believe that you have the power to change? Rise up. Make this your year. The simple things are often times not the easy things. But they're the things that have to be done over and over consistently in order for you to be great. It doesn't matter what that person thinks about you, it matters what you think about you, it matters what you believe in your heart and soul. Didn't want to do it, but I ran. I'm sweating, I'm dripping. Because I believe in order for me to talk to you, I have to do it. I gotta own it. I wanna be healthy, I gotta run. I wanna be fit, I gotta eat right. I wanna be strong, I gotta lift weight. I wanna be a better father, I gotta learn to be more patient. I gotta be a better spouse, I gotta learn to be more humble. Stop being so stubborn. We know what we gotta do. But are you doing it? We know how to live the right life. But do you know how to live the right life for you, not for others? Stop staring at your past because you'll never see the future. If you keep looking back at the mistakes and trials and tribulations that you've encountered in life. I truly believe we as human beings were born to be great. Listen to me. I said great. I didn't say average. I didn't say normal. I said great. I will never stop believing in me, no matter what. I don't need someone else to believe in me, nor me believing in myself. I don't care whose fault it is. It ain't your fault that you came from a broken home. It ain't your fault that your mom is single parent, daddy's not around. It ain't your fault that one of your parents is an alcoholic. It ain't your fault that your family is broke, poor. It's definitely not your fault what color of skin you live in. But I can promise you, I can assure you that there's going to be adversity. There's going to be obstacles. There's going to be disasters that's going to come your way. They're going to be made to tear you down and destroy you. But if you sit there and start pointing fingers and playing the blame game, you will fail. So stop playing with everybody else except for yourself. You better believe that failure is coming if you keep on with that weak mindset. You were not born to lose, you were born to win. You're a winner. You were born to be great. Believe it. There is greatness inside of you. So stop worrying about what everybody else is doing and start worrying about what you're going to do in order to get the life that you want. In order for you to live the life that you want, you got to do the things that you don't want. In order for you to live the life of luxury, of health, of wealth, of happiness, you got to make sacrifices. If it comes easy and fast, it's going to leave the exact same way. You can do much better than what you're doing. Stop settling for second place, third place, fourth place. Stop settling. Stop being content, being selfish, stubborn. Stop being content just getting by. Week by week, some weeks you'll fall behind. Stop being content because when you look in the mirror at the end of the day, you can't fool the person looking back on you. Everybody on social media ain't the person that you think they are. Because you are great. You are amazing and I believe in you. If you don't believe in you, I believe in you because that's what it took for me to be great. I've stumbled, I've fell. Heck, I still fall. But you know what I do? What I do best, what sets me apart from the rest, I get up. After I fall, I get up. After I fall, I get up. What are you fighting for in life? You're fighting for something every single day. To be a fighter is going to take guts, it's going to take glory, passion, it's going to take heart, it's going to take feeling. To fight it takes you to some of the dark depths of life. Being a fighter, you've got to be ready to sacrifice. You have to sacrifice your friends, sacrifice your social life. Fighters spend tons of time isolated in darkness, obsessing, obsessing while their friends are out partying. You're out there spending time trading. You're dying inside at home holding your skills. You're a fighter. You're a fighter so fight. What are you waiting for? You are there to win. You're not backing out with nobody. I need you to start believing in you. I need you to become the driver of your life, not the passenger. Get your tail out of the passenger seat, jump in the driver's seat and floor it. Start grinding for your life, for your success because it's in you. Whether you can see it or not, I'm telling you it's in you and guess what? It's going to get hard when you're closest to your goals. So stop sulking, stop whining and just attest to see how bad you are. It might not be your fault but it sure is your responsibility to fix it. It's your responsibility to right all the wrongs set against you so you can rise to be great. Don't be that woman, don't be that man, don't be that kid that keeps pointing fingers. I've been dealt my fair share of marks in life and I am positive that there's more to come. But guess what? Like you, I overcame it with love, with passion, focus, purpose. I succeeded because I owned up to all my faults. I took responsibility for every single fault and I could possibly wrap my thoughts around. Because if I didn't do it, nobody else will. You can't wait for nobody else. You gotta own it. I don't care who's fault it is. If you don't fix it, I promise you, if you don't take action towards it, it's going to be your responsibility why you succeeded or why you failed. When you point fingers at people, guess what? There's four more fingers pointing right back at you. Own every second of your life because it's yours. No one else is going to give you anything you did not earn or deserve. Life is hard. It's hard guys, I know it is. But guess what? If you want to live an amazing life, you gotta do amazing things. You gotta do those things that nobody else wants to do so you can live that life that nobody else can. Get up and just do it. You gotta dig. You gotta dig deep. You gotta own it. I don't know what it is for you, but you gotta own it. Own it. Swallly up, swallow down. Remember that you are not perfect, so get over yourself. One thing I know that you're perfectly imperfect just like me. What do you do to better yourself? Are you owning it? Are you taking responsibility? Or you're blaming somebody else for the wrongs against you. It's not your fault, but it's your responsibility to fix it. It's your life and nobody else will do it for you. So get up and go do those things that you don't want to do when you don't want to do them at the moment. And that's what we're here to do. So get up and get set. And set yourself apart from being average, because you're not average. You are great. It's greatness that puts in you. It's time for you to get the breakthrough that you deserve today. And fight this good fight, because you're gonna be a fighter every single day for the rest of your life. It's your life. It's your life. So guess what, guys? If you do the hard things in life, life is easy. But if you do the easy things in life, life is gonna be hard. The choice is yours. What are you gonna do with it? Rise! You know, the chase is hard. But it's worth it. I want to talk to an individual out there, a king, a queen, a mother, a father, a grandfather. And I want to tell you that where you are right now is not your forever. You see, life is hard and the chase, it'll almost drive a man insane. But with the belief in God, an ordinary man can rise to an occasion and get a world something they've never seen before. You see, I was a project kid from Pontiac, Michigan. Mother a heroin addict, father in the streets. Only thing I seen was people selling crack cocaine, selling heroin, selling pounds of marijuana. As a kid, they thought that that's what I would grow into. That's what I would form into. But God had other plans. I say this to tell you that no matter what you placed in front of, that is not your forever. That is only a barrier that God has already given you the strength to remove. You see, I was this young kid that woke up every single day and all he wanted to do is save his mom. I would watch my mama watch beautiful shows on the television. She would look at those dresses, she would look at those cars, she would look at those homes and I could see the pain in her eyes. I could tell that she wanted to give us this. But all the pain she felt, the funny thing is I felt. And that was the fuel to push me to the next level of my life. That was the fuel. So when I stepped in front of another opponent on that football field, I told him my life was on the line and I can't move. But we got two choices baby, are you going to fly or are you going to die? No matter if you're born in the belly of the projects, you have something special. You have this special gift to give to the world and the only way you're going to bring it to life is if you believe it here. And speak it here. See, motivation is only a reminder of the greatness that already lies inside of you. They try to make it this huge thing but the trophy is greatest lies in every single one of us. You can't listen to the echoes of other people when you're talking about your dream. So if you go into the darkness alone, you're going to go to the light alone. And you can't be afraid to walk alone. Thank you for watching."}, "podcast_summary": "In this podcast, the speaker emphasizes the importance of believing in oneself and taking responsibility for one's own life. They encourage listeners to overcome obstacles, ignore haters, and keep pushing towards their goals. They stress the need to take action and make sacrifices in order to achieve greatness. The speaker shares personal stories and experiences to inspire listeners to pursue their dreams and not settle for mediocrity. Overall, the podcast emphasizes the power of belief, perseverance, and self-empowerment.", "podcast_guest": {"name": "Billy Al's Rooks", "summary": "Not Available"}, "podcast_highlights": "- \"The fire and truth on the inside of you will make room for you, whether the haters like you or not.\"\n- \"Doubt is the best salesman, trying to sell you on the lie that you aren't good enough.\"\n- \"Each time you face something you fear in truth, you go to a deeper level of growth, awareness, and personal power.\"\n- \"There are three types of people in this world: those in the game, those on the sidelines, and those in the sand. Which one do you want to be?\"\n- \"Every day is a new opportunity to become a little bit better, a little bit smarter, and a little bit stronger than you were yesterday.\""}